{
  "physics": {
    "foundation": [
      {
        "equation": "\\rho = \\frac{m}{V}",
        "title": "Density",
        "description": "Density is a fundamental property of matter, defined as mass per unit volume. It describes how much matter is packed into a given space and is a critical concept in physics, chemistry, and engineering. The formula \\(\\rho = \\frac{m}{V}\\) is used to calculate the density \\(\\rho\\) of an object or substance when its mass \\(m\\) and volume \\(V\\) are known. This equation is essential in determining whether an object will float or sink in a fluid, predicting the behavior of materials under different conditions, and solving various real-world problems. High-density materials have more mass in a given volume, making them heavier, while low-density materials are lighter. The equation can also be rearranged to solve for mass \\(m = \\rho V\\) or volume \\(V = \\frac{m}{\\rho}\\) depending on the information provided."
      },
      {
        "equation": "v = f \\lambda",
        "title": "Wave Speed",
        "description": "The wave speed equation \\(v = f \\lambda\\) relates the speed \\(v\\) of a wave to its frequency \\(f\\) and wavelength \\(\\lambda\\). Wave speed is the distance a wave travels per unit of time, and it depends on the medium through which the wave is propagating. For example, light waves travel faster in a vacuum than in air, and sound waves travel faster in water than in air. The frequency of a wave is the number of cycles that pass a point per second, and the wavelength is the distance between consecutive crests or troughs. This equation is vital in understanding phenomena such as the Doppler effect, where the frequency of waves changes due to the relative motion between the source and observer. It can also be used to determine the properties of waves in various contexts, such as sound waves in musical instruments, light waves in optics, and seismic waves in geology."
      },
      {
        "equation": "W = mg",
        "title": "Weight",
        "description": "Weight \\(W\\) is the force exerted on an object due to gravity, calculated by multiplying its mass \\(m\\) by the gravitational field strength \\(g\\). While mass is a measure of the amount of matter in an object and remains constant regardless of location, weight can change depending on the gravitational pull of the planet or moon the object is on. For example, an object will weigh less on the Moon than on Earth due to the Moon's weaker gravitational field. This equation helps explain why objects fall to the ground when dropped and why different planets have different gravitational forces. The concept of weight is crucial in engineering, construction, and physics, where understanding the forces acting on objects is necessary for designing structures, vehicles, and machinery."
      },
      {
        "equation": "W = Fs",
        "title": "Work Done",
        "description": "Work done \\(W\\) is the energy transferred when a force \\(F\\) moves an object through a distance \\(s\\) in the direction of the force. It is a measure of the effort required to move an object, and it is calculated using the equation \\(W = Fs\\). Work is a scalar quantity, meaning it has magnitude but no direction. The concept of work is fundamental in mechanics, where it is used to analyze the movement of objects and the energy changes that occur during motion. This equation is also central to understanding the conservation of energy, as the work done on an object results in a change in its kinetic or potential energy. The unit of work is the joule (J), where one joule is equivalent to one newton-meter."
      },
      {
        "equation": "F = ke",
        "title": "Force on a Spring",
        "description": "The equation \\(F = ke\\) describes the force \\(F\\) exerted by a spring when it is stretched or compressed by a distance \\(e\\) from its equilibrium position. The constant \\(k\\) is the spring constant, which measures the stiffness of the spring. This relationship is known as Hooke's Law and applies to elastic materials that return to their original shape after deformation. Hooke's Law is used in designing and analyzing systems that involve springs, such as suspension systems in vehicles, measuring instruments like force gauges, and various mechanical devices. The law is also essential in understanding the behavior of materials under stress and strain, helping engineers and scientists predict how materials will respond to applied forces. The spring constant \\(k\\) varies depending on the material and dimensions of the spring, and it is determined experimentally."
      },
      {
        "equation": "M = Fd",
        "title": "Moment of a Force",
        "description": "The moment of a force, also known as torque, is the turning effect of a force applied to a point at a distance \\(d\\) from a pivot or fulcrum. The equation \\(M = Fd\\) calculates the moment \\(M\\), where \\(F\\) is the force applied and \\(d\\) is the perpendicular distance from the pivot to the line of action of the force. Moments are crucial in mechanical engineering, architecture, and physics, as they help analyze the stability and rotation of structures and objects. For example, the moment of a force is used to design levers, gears, and pulleys, ensuring they operate efficiently and safely. The concept of moments also plays a significant role in biomechanics, where it helps understand how muscles and joints produce movement in the human body."
      },
      {
        "equation": "p = \\frac{F}{A}",
        "title": "Pressure",
        "description": "Pressure \\(p\\) is defined as the force \\(F\\) applied perpendicular to the surface of an object divided by the area \\(A\\) over which the force is distributed. The equation \\(p = \\frac{F}{A}\\) is used to calculate pressure in fluids and solids. Pressure is a crucial concept in fluid mechanics, where it helps explain the behavior of liquids and gases in various situations, such as in hydraulics, aerodynamics, and weather systems. In solids, pressure is used to analyze the stress on materials, which is essential in engineering and construction. The unit of pressure is the pascal (Pa), where one pascal is equivalent to one newton per square meter. Understanding pressure is also vital in everyday life, such as in designing tires, understanding atmospheric pressure, and analyzing the forces acting on submerged objects."
      },
      {
        "equation": "s = vt",
        "title": "Distance Travelled",
        "description": "The equation \\(s = vt\\) calculates the distance \\(s\\) travelled by an object moving at a constant speed \\(v\\) over a time \\(t\\). This equation is fundamental in kinematics, where it is used to describe the motion of objects in one dimension. The concept of distance travelled is essential in various fields, including transportation, where it helps plan routes and schedules, and in physics, where it is used to analyze the motion of particles, vehicles, and celestial bodies. The equation can also be rearranged to solve for speed \\(v = \\frac{s}{t}\\) or time \\(t = \\frac{s}{v}\\), depending on the information available. This simple yet powerful equation underpins many aspects of motion and is a building block for more complex analyses in dynamics and mechanics."
      },
      {
        "equation": "a = \\frac{\\Delta v}{t}",
        "title": "Acceleration",
        "description": "Acceleration \\(a\\) is the rate of change of velocity \\(\\Delta v\\) over time \\(t\\). The equation \\(a = \\frac{\\Delta v}{t}\\) describes how quickly an object's velocity changes, whether it is speeding up, slowing down, or changing direction. Acceleration is a vector quantity, meaning it has both magnitude and direction. Understanding acceleration is crucial in analyzing motion, from simple cases like a car accelerating on a road to complex systems like rockets launching into space. It also plays a key role in Newton's Second Law of Motion, which relates force, mass, and acceleration. The unit of acceleration is meters per second squared (m/s²). Acceleration can also be calculated from the change in speed when direction is not a factor, making it applicable in various practical situations."
      },
      {
        "equation": "F = ma",
        "title": "Resultant Force",
        "description": "The equation \\(F = ma\\) represents Newton's Second Law of Motion, which states that the force \\(F\\) acting on an object is the product of its mass \\(m\\) and acceleration \\(a\\). This law explains how forces cause changes in the motion of objects, and it is fundamental to understanding dynamics in physics. The resultant force is the net force acting on an object when all individual forces are combined. If the resultant force is non-zero, the object will accelerate in the direction of the force; if it is zero, the object will remain at rest or continue moving at a constant velocity. This equation is used extensively in engineering, mechanics, and everyday life to predict how objects will respond to applied forces. It is also the basis for understanding momentum, energy, and other key concepts in physics."
      },
      {
        "equation": "E_k = \\frac{1}{2}mv^2",
        "title": "Kinetic Energy",
        "description": "Kinetic energy \\(E_k\\) is the energy an object possesses due to its motion. The equation \\(E_k = \\frac{1}{2}mv^2\\) shows that kinetic energy is proportional to the mass \\(m\\) of the object and the square of its speed \\(v\\). This quadratic relationship means that even small increases in speed result in significant increases in kinetic energy. Kinetic energy is a form of mechanical energy and plays a vital role in various physical processes, from the movement of planets to the operation of machines. It is also central to the conservation of energy principle, where the total energy in a closed system remains constant. Kinetic energy can be converted into other forms of energy, such as potential energy or heat, depending on the context."
      },
      {
        "equation": "E_p = mgh",
        "title": "Gravitational Potential Energy",
        "description": "Gravitational potential energy \\(E_p\\) is the energy an object has due to its position in a gravitational field. The equation \\(E_p = mgh\\) calculates this energy, where \\(m\\) is the object's mass, \\(g\\) is the gravitational field strength, and \\(h\\) is the height above a reference point. This form of potential energy is most commonly associated with objects near the Earth's surface, where the gravitational field strength is approximately 9.8 m/s². Gravitational potential energy is crucial in understanding phenomena such as the behavior of roller coasters, the orbits of planets, and the energy stored in water reservoirs for hydroelectric power. It is also a key component in the conservation of mechanical energy, where the sum of kinetic and potential energies remains constant in the absence of non-conservative forces."
      },
      {
        "equation": "P = \\frac{W}{t} = \\frac{E}{t}",
        "title": "Power",
        "description": "Power \\(P\\) is the rate at which work \\(W\\) is done or energy \\(E\\) is transferred over time \\(t\\). The equation \\(P = \\frac{W}{t} = \\frac{E}{t}\\) is used to calculate power, with the unit of measurement being the watt (W), where one watt equals one joule per second. Power is an essential concept in both mechanical and electrical systems, where it describes how quickly energy is used or produced. In everyday life, power ratings are commonly seen in appliances, engines, and electrical devices, indicating how much energy they consume or generate. The concept of power is also crucial in understanding efficiency and performance in various contexts, such as in engines, where higher power often means greater performance, or in renewable energy systems, where power output is a key measure of effectiveness."
      },
      {
        "equation": "\\text{efficiency} = \\frac{\\text{useful energy output}}{\\text{total energy input}}",
        "title": "Efficiency",
        "description": "Efficiency is a measure of how effectively a system converts input energy into useful output energy. The equation \\(\\text{efficiency} = \\frac{\\text{useful energy output}}{\\text{total energy input}}\\) expresses this concept as a ratio, often multiplied by 100 to give a percentage. An efficiency of 100% means that all the input energy is converted into useful output, with no losses, which is an ideal scenario. In reality, no system is perfectly efficient due to energy losses, usually as heat, sound, or other forms of non-useful energy. Understanding efficiency is crucial in engineering, economics, and environmental science, where optimizing energy use and reducing waste are essential goals. Efficiency is used to evaluate the performance of engines, machines, power plants, and even everyday appliances, influencing design and operational decisions."
      },
      {
        "equation": "Q = It",
        "title": "Charge Flow",
        "description": "Charge flow \\(Q\\) represents the total charge that passes through a point in an electrical circuit over time. The equation \\(Q = It\\) relates charge flow to the current \\(I\\) and the time \\(t\\) the current flows. Charge flow is measured in coulombs (C), where one coulomb is equivalent to the charge of approximately 6.242 x 10¹⁸ electrons. This equation is fundamental in understanding electrical circuits, where it helps to calculate the total charge transferred in a given time, which is essential for analyzing the behavior of components like capacitors and batteries. It also underpins the relationship between current, voltage, and resistance, playing a vital role in the study of electricity and magnetism."
      },
      {
        "equation": "V = IR",
        "title": "Potential Difference (Ohm's Law)",
        "description": "Ohm's Law is one of the fundamental principles of electrical circuits, stating that the potential difference \\(V\\) across a conductor is directly proportional to the current \\(I\\) flowing through it, with the proportionality constant being the resistance \\(R\\). The equation \\(V = IR\\) is used to calculate the voltage, current, or resistance in a circuit, depending on the known values. Ohm's Law applies to most electrical conductors and is essential for designing and analyzing electrical circuits, ensuring that components are used within their operating limits. The concept of resistance explains how materials impede the flow of electric current, with higher resistance leading to lower current for a given voltage. This law is widely used in engineering, electronics, and physics, forming the basis for much of modern electrical technology."
      },
      {
        "equation": "P = IV",
        "title": "Electrical Power",
        "description": "Electrical power \\(P\\) is the rate at which electrical energy is transferred by a circuit. The equation \\(P = IV\\) calculates the power by multiplying the current \\(I\\) by the potential difference \\(V\\) across the circuit. Electrical power is measured in watts (W), where one watt equals one joule per second. This equation is crucial for understanding how much energy is being used or generated in electrical devices, from household appliances to large power plants. It also plays a significant role in determining the efficiency and performance of electrical systems, influencing everything from energy consumption to the design of power supplies and generators."
      },
      {
        "equation": "P = I^2R",
        "title": "Power Dissipation in a Resistor",
        "description": "The equation \\(P = I^2R\\) describes the power dissipated as heat in a resistor, where \\(P\\) is the power, \\(I\\) is the current, and \\(R\\) is the resistance. This relationship shows that the power dissipation increases with the square of the current, making it particularly important in high-current applications. Power dissipation is a key factor in the design of electrical circuits, where excessive heat generation can damage components or reduce efficiency. Understanding this equation helps engineers design systems that manage heat effectively, ensuring that components operate safely within their thermal limits. It also underscores the importance of selecting appropriate resistors for specific applications to minimize energy losses."
      },
      {
        "equation": "E = Pt",
        "title": "Energy Transferred",
        "description": "The equation \\(E = Pt\\) calculates the total energy \\(E\\) transferred or used by a device over time \\(t\\), where \\(P\\) is the power. This relationship is fundamental in both mechanical and electrical systems, providing a straightforward way to determine the energy consumption of a device based on its power rating and the duration of use. The concept of energy transferred is crucial in understanding the efficiency and cost of running electrical appliances, vehicles, and industrial machines. It also plays a role in calculating energy bills, as the total energy consumed over a billing period is what consumers are charged for."
      },
      {
        "equation": "E = QV",
        "title": "Energy Transferred by Charge",
        "description": "The equation \\(E = QV\\) represents the energy \\(E\\) transferred by an electric charge \\(Q\\) moving through a potential difference \\(V\\). This relationship is fundamental in the study of electricity and helps explain how energy is stored and released in electrical systems, such as batteries and capacitors. The energy transferred can be used to perform work, such as lighting a bulb, driving a motor, or heating a resistor. This equation also underpins the operation of many electrical devices and is critical for understanding how energy is managed and conserved in circuits. The concept is widely applicable in electronics, from designing efficient power supplies to understanding the energy requirements of various devices."
      }
    ],
    "higher": [
      {
        "equation": "\\Delta E = mc\\Delta \\theta",
        "title": "Change in Thermal Energy",
        "description": "The equation \\(\\Delta E = mc\\Delta \\theta\\) calculates the change in thermal energy \\(\\Delta E\\) of a substance when its temperature changes by \\(\\Delta \\theta\\). Here, \\(m\\) is the mass of the substance, and \\(c\\) is the specific heat capacity, which measures the amount of energy required to raise the temperature of one kilogram of the substance by one degree Celsius. This equation is crucial in thermodynamics, where it helps analyze heat transfer in various systems, from simple heating of water to complex industrial processes. Specific heat capacity is a unique property of materials, with different substances requiring different amounts of energy to change temperature. Understanding this concept is vital for designing thermal systems, such as radiators, engines, and climate control systems, where managing temperature is essential for efficiency and safety."
      },
      {
        "equation": "E = mL",
        "title": "Thermal Energy for a Change in State",
        "description": "The equation \\(E = mL\\) calculates the thermal energy \\(E\\) required for a substance to change its state, such as from solid to liquid (melting) or liquid to gas (evaporation), without changing its temperature. Here, \\(m\\) is the mass of the substance, and \\(L\\) is the specific latent heat, which is the amount of energy required to change the state of one kilogram of the substance. This concept is critical in understanding phase transitions, where energy is absorbed or released without a temperature change. Specific latent heat is unique to each substance and depends on the nature of the phase change. This equation is widely used in fields like meteorology, where it helps explain phenomena such as the formation of clouds and rain, and in engineering, where it is essential for designing systems that involve heat exchange, such as refrigerators and heat pumps."
      },
      {
        "equation": "pV = \\text{constant}",
        "title": "Pressure-Volume Relationship for Gases (Boyle's Law)",
        "description": "Boyle's Law describes the relationship between the pressure \\(p\\) and volume \\(V\\) of a fixed amount of gas at constant temperature. The equation \\(pV = \\text{constant}\\) shows that the product of pressure and volume remains constant as long as the temperature and the amount of gas do not change. This inverse relationship means that as the volume of the gas decreases, its pressure increases, and vice versa. Boyle's Law is fundamental in understanding the behavior of gases in various contexts, from the functioning of internal combustion engines to the design of pressure vessels and syringes. It also plays a key role in the study of thermodynamics and fluid mechanics, where the behavior of gases under different conditions is analyzed."
      },
      {
        "equation": "T = \\frac{1}{f}",
        "title": "Time Period of a Wave",
        "description": "The time period \\(T\\) of a wave is the time it takes for one complete cycle of the wave to pass a point. The equation \\(T = \\frac{1}{f}\\) relates the time period to the frequency \\(f\\) of the wave, where frequency is the number of cycles per second. This relationship is crucial in understanding wave phenomena, from sound waves to electromagnetic waves. The time period is inversely proportional to the frequency, meaning that higher frequency waves have shorter time periods. This concept is essential in various applications, such as in the design of musical instruments, the analysis of radio signals, and the study of light waves in optics. It also helps in understanding resonance, where certain frequencies cause objects to vibrate with large amplitudes."
      },
      {
        "equation": "M = \\frac{h_{image}}{h_{object}}",
        "title": "Magnification",
        "description": "Magnification \\(M\\) is a measure of how much larger or smaller an image is compared to the object itself. The equation \\(M = \\frac{h_{image}}{h_{object}}\\) relates the magnification to the height of the image \\(h_{image}\\) and the height of the object \\(h_{object}\\). This concept is widely used in optics, where lenses and mirrors are employed to create magnified images in devices such as microscopes, telescopes, and cameras. Magnification can be greater than one (for enlarged images) or less than one (for reduced images), and it can be positive or negative depending on the orientation of the image. Understanding magnification is essential in designing optical instruments and in various fields of science and engineering where precise visualization of small or distant objects is required."
      },
      {
        "equation": "F = BIl",
        "title": "Force on a Current-Carrying Conductor",
        "description": "The equation \\(F = BIl\\) calculates the force \\(F\\) exerted on a conductor carrying an electric current \\(I\\) in a magnetic field \\(B\\), where \\(l\\) is the length of the conductor within the magnetic field. This relationship is fundamental in the study of electromagnetism and underpins the operation of many electrical devices, such as electric motors, generators, and loudspeakers. The direction of the force is given by the left-hand rule, which states that the thumb, first finger, and middle finger represent the directions of the force, magnetic field, and current, respectively. Understanding this equation is crucial for designing and analyzing systems where electric currents interact with magnetic fields, leading to the conversion of electrical energy into mechanical energy and vice versa."
      },
      {
        "equation": "\\frac{V_P}{V_S} = \\frac{N_P}{N_S}",
        "title": "Transformer Equation",
        "description": "The transformer equation \\(\\frac{V_P}{V_S} = \\frac{N_P}{N_S}\\) describes the relationship between the potential differences (voltages) across the primary \\(V_P\\) and secondary \\(V_S\\) coils of a transformer and the number of turns in each coil \\(N_P\\) and \\(N_S\\). This equation is essential in understanding how transformers work, allowing for the step-up or step-down of voltages in electrical circuits. Transformers are crucial components in power distribution systems, enabling the efficient transmission of electrical energy over long distances by converting high voltages to lower, more usable levels. The equation highlights the proportional relationship between voltage and the number of coil turns, illustrating how changes in one affect the other. Understanding this concept is vital for electrical engineering, particularly in the design and operation of power grids, electronic devices, and various industrial applications."
      },
      {
        "equation": "V_P I_P = V_S I_S",
        "title": "Power in a Transformer",
        "description": "The equation \\(V_P I_P = V_S I_S\\) expresses the principle of conservation of energy in an ideal transformer, where the power input to the primary coil \\(V_P I_P\\) equals the power output from the secondary coil \\(V_S I_S\\). This relationship assumes that there are no energy losses in the transformer, meaning that the product of voltage and current remains constant across the primary and secondary coils. This equation is crucial in the design and operation of transformers, ensuring that the desired voltage and current levels are achieved while maintaining efficiency. It also underscores the importance of minimizing losses in real-world transformers, where factors such as resistance, core losses, and leakage inductance can reduce efficiency. Understanding this equation is essential for optimizing transformer performance in power generation, distribution, and various electrical applications."
      },
      {
        "equation": "p = h \\rho g",
        "title": "Pressure in a Fluid Column",
        "description": "The equation \\(p = h \\rho g\\) calculates the pressure \\(p\\) at a depth \\(h\\) in a fluid column, where \\(\\rho\\) is the density of the fluid and \\(g\\) is the gravitational field strength. This relationship is fundamental in fluid mechanics, explaining how pressure increases with depth in a fluid, such as water in a lake or air in the atmosphere. The equation is crucial for understanding various natural and industrial processes, from calculating the pressure at the bottom of a swimming pool to designing dams, submarines, and barometers. It also plays a role in geology, where it helps explain the pressure exerted by overlying rock layers in the Earth's crust. Understanding this equation is vital for fields that involve fluid dynamics, including hydraulics, meteorology, and environmental science."
      },
      {
        "equation": "v^2 - u^2 = 2as",
        "title": "Kinematic Equation for Uniform Acceleration",
        "description": "The kinematic equation \\(v^2 - u^2 = 2as\\) relates the final velocity \\(v\\) and initial velocity \\(u\\) of an object undergoing uniform acceleration \\(a\\) over a distance \\(s\\). This equation is one of the fundamental relationships in kinematics, used to analyze the motion of objects when they are subjected to constant acceleration. It is particularly useful when time is not a directly available variable, allowing for the calculation of one of the other variables if the others are known. This equation is applied in various contexts, from understanding the motion of vehicles on a road to analyzing the trajectories of projectiles. It is also a key component in solving problems related to free-fall, where objects accelerate due to gravity."
      },
      {
        "equation": "F = \\frac{\\Delta p}{t}",
        "title": "Force and Change in Momentum",
        "description": "The equation \\(F = \\frac{\\Delta p}{t}\\) expresses the relationship between force \\(F\\), change in momentum \\(\\Delta p\\), and time \\(t\\). This equation is derived from Newton's Second Law of Motion and highlights the concept of impulse, which is the change in momentum resulting from a force applied over time. Momentum \\(p\\) is the product of an object's mass and velocity, and changes in momentum occur when a force is applied. This equation is crucial for understanding collisions, where the force and duration of impact determine the change in momentum of the objects involved. It is also used in various fields, including engineering, sports science, and vehicle safety, where managing forces and momentum is essential for optimizing performance and safety."
      }
    ]
  },
  "chemistry": {
    "foundation": [
      {
        "equation": "\\text{concentration} = \\frac{\\text{mass (g)}}{\\text{volume (dm}^3)}",
        "title": "Concentration in g/dm³",
        "description": "Concentration is a measure of how much solute is dissolved in a given volume of solution. The equation calculates the concentration in grams per cubic decimeter (g/dm³) by dividing the mass of the solute (in grams) by the volume of the solution (in dm³). This concept is fundamental in chemistry, especially when preparing solutions for reactions, and is widely used in laboratories, medicine, and industry."
      },
      {
        "equation": "\\text{mean rate of reaction} = \\frac{\\text{quantity of reactant used}}{\\text{time taken}}",
        "title": "Rate of Reaction (Reactant)",
        "description": "The mean rate of reaction measures how fast a reactant is consumed in a chemical reaction over time. This rate is crucial in determining the speed of a reaction, which is important in both industrial processes and laboratory experiments. The equation provides insight into how quickly a reaction proceeds, which can affect yields, safety, and efficiency."
      },
      {
        "equation": "\\text{mean rate of reaction} = \\frac{\\text{quantity of product formed}}{\\text{time taken}}",
        "title": "Rate of Reaction (Product)",
        "description": "Similar to the rate of reaction for reactants, this equation measures how quickly a product is formed in a reaction. Understanding this rate helps chemists control reaction conditions to maximize product yield, essential in manufacturing, pharmaceuticals, and environmental science."
      },
      {
        "equation": "Rf = \\frac{\\text{distance moved by substance}}{\\text{distance moved by solvent}}",
        "title": "Chromatography (Rf Value)",
        "description": "The Rf value in chromatography is a ratio that represents how far a substance travels relative to the solvent front. It is a key concept in separating and identifying compounds in a mixture, commonly used in forensic science, pharmaceuticals, and food testing. The Rf value is unique to each substance under specific conditions, making it a valuable tool for qualitative analysis."
      }
    ],
    "higher": [
      {
        "equation": "\\text{moles} = \\frac{\\text{mass}}{M_r}",
        "title": "Moles (HT)",
        "description": "This equation calculates the number of moles of a substance by dividing the mass (in grams) by its relative atomic or molecular mass (Mr). Moles are a fundamental unit in chemistry that allows chemists to count particles, atoms, or molecules by relating mass to the number of entities. Understanding moles is crucial for stoichiometry, reaction predictions, and balancing chemical equations."
      },
      {
        "equation": "6.02 \\times 10^{23}",
        "title": "Avogadro's Number (HT)",
        "description": "Avogadro's number is the number of particles (atoms, molecules, ions) in one mole of a substance. It is a fundamental constant in chemistry that allows chemists to relate macroscopic amounts of material to the number of atoms or molecules. This concept is essential in understanding chemical reactions, where precise quantities of substances interact according to stoichiometric ratios."
      },
      {
        "equation": "\\text{concentration} = \\frac{\\text{moles (mol)}}{\\text{volume (dm}^3)}",
        "title": "Concentration in mol/dm³ (HT)",
        "description": "This equation calculates the concentration of a solution in moles per cubic decimeter (mol/dm³), which is a more precise way of expressing concentration, especially in reactions where the number of moles directly determines the outcome. This form of concentration is commonly used in titrations and other quantitative chemical analyses."
      },
      {
        "equation": "\\text{moles} = \\text{concentration} \\times \\text{volume (in dm}^3)",
        "title": "Moles from Concentration and Volume (HT)",
        "description": "This equation allows chemists to calculate the number of moles in a solution when its concentration and volume are known. It is particularly useful in titrations and when preparing solutions for reactions, where knowing the exact amount of reactants is crucial for achieving the desired outcome."
      },
      {
        "equation": "\\text{volume (dm}^3) = \\text{moles} \\times 24\\text{dm}^3",
        "title": "Gas Volumes (HT)",
        "description": "This equation calculates the volume of a gas at standard temperature and pressure (STP) given the number of moles. One mole of any gas occupies 24dm³ at STP. This relationship is vital for predicting the behavior of gases in reactions, particularly in industrial applications like the synthesis of chemicals or the operation of internal combustion engines."
      },
      {
        "equation": "\\text{Percentage Yield} = \\frac{\\text{Mass of product actually made} \\times 100}{\\text{Maximum theoretical mass of product}}",
        "title": "Percentage Yield (HT)",
        "description": "Percentage yield measures the efficiency of a chemical reaction by comparing the actual mass of product obtained to the theoretical maximum. It is crucial in industrial chemistry to assess the effectiveness of a reaction process, minimizing waste, and optimizing costs. Understanding percentage yield helps in scaling up reactions for commercial production and in improving reaction conditions."
      },
      {
        "equation": "\\text{C}(s) + \\text{O}_2(g) \\rightarrow \\text{CO}_2(g)",
        "title": "Combustion of Carbon",
        "description": "The combustion of carbon in oxygen produces carbon dioxide, a reaction that releases energy in the form of heat and light. This reaction is fundamental in understanding how fossil fuels like coal burn and release energy, which is critical in power generation, industrial processes, and environmental science. Combustion reactions are also key in understanding the carbon cycle and its impact on climate change."
      },
      {
        "equation": "\\text{H}_2(g) + \\text{O}_2(g) \\rightarrow \\text{H}_2\\text{O}(g)",
        "title": "Combustion of Hydrogen",
        "description": "Hydrogen combusts in oxygen to form water vapor, a reaction that releases a significant amount of energy. This reaction is the basis for hydrogen fuel cells, which are being developed as a clean energy technology. Understanding this reaction is also important in studying the chemistry of stars, where hydrogen fusion occurs, and in considering alternative energy sources."
      },
      {
        "equation": "\\text{CH}_4 + \\text{O}_2 \\rightarrow \\text{CO}_2 + \\text{H}_2\\text{O}",
        "title": "Combustion of Hydrocarbons",
        "description": "The combustion of hydrocarbons like methane in oxygen produces carbon dioxide and water, releasing energy. This reaction is the foundation of how fossil fuels such as natural gas and petroleum are used to generate energy in engines, power plants, and heating systems. Understanding this reaction is critical for addressing issues related to energy production, efficiency, and environmental impact, particularly concerning greenhouse gas emissions."
      },
      {
        "equation": "\\text{2Cu}(s) + \\text{O}_2(g) \\rightarrow \\text{2CuO}(s)",
        "title": "Oxidation of Metals",
        "description": "Copper reacts with oxygen to form copper (II) oxide, an example of a metal oxidation reaction. This reaction is important in understanding corrosion, where metals deteriorate due to exposure to oxygen and moisture. It also plays a role in the production of metal oxides used in various industrial processes, including electronics, pigments, and catalysts."
      },
      {
        "equation": "\\text{2Na}(s) + \\text{2H}_2\\text{O}(l) \\rightarrow \\text{2NaOH}(aq) + \\text{H}_2(g)",
        "title": "Reaction of Metals with Water",
        "description": "Sodium reacts with water to produce sodium hydroxide and hydrogen gas, a highly exothermic reaction that illustrates the reactivity of alkali metals. This reaction is crucial in understanding the properties of Group 1 elements in the periodic table and their potential hazards. It also highlights the production of hydrogen gas, which has implications for energy production and storage."
      },
      {
        "equation": "\\text{2NaBr}(aq) + \\text{Cl}_2(aq) \\rightarrow \\text{Br}_2(aq) + \\text{2NaCl}(aq)",
        "title": "Displacement of Halogens",
        "description": "In this reaction, chlorine displaces bromine from sodium bromide, demonstrating the reactivity trend of halogens in the periodic table. Displacement reactions are fundamental in understanding the behavior of elements and are widely used in industrial processes, such as the extraction of elements and the purification of compounds."
      },
      {
        "equation": "\\text{Mg}(s) + 2\\text{HCl}(aq) \\rightarrow \\text{MgCl}_2(aq) + \\text{H}_2(g)",
        "title": "Reaction of Metal with Acid",
        "description": "Magnesium reacts with hydrochloric acid to produce magnesium chloride and hydrogen gas. This reaction is an example of a metal-acid reaction, which is important in understanding the reactivity of metals and the production of hydrogen gas. It is also used in laboratory settings to produce salts and in industrial processes involving the extraction and processing of metals."
      },
      {
        "equation": "\\text{CuO}(s) + 2\\text{HCl}(aq) \\rightarrow \\text{CuCl}_2(aq) + \\text{H}_2\\text{O}(l)",
        "title": "Reaction of Metal Oxide with Acid",
        "description": "Copper (II) oxide reacts with hydrochloric acid to form copper (II) chloride and water. This reaction is an example of a metal oxide reacting with an acid to produce a salt and water, a type of neutralization reaction. Understanding this reaction is important in the context of acid-base chemistry and is widely applied in industrial processes for producing salts and in waste treatment."
      },
      {
        "equation": "\\text{CuSO}_4(aq) + \\text{Mg}(s) \\rightarrow \\text{MgSO}_4(aq) + \\text{Cu}(s)",
        "title": "Displacement of Metals",
        "description": "Magnesium displaces copper from copper (II) sulfate in this reaction, demonstrating the reactivity series of metals. Displacement reactions are key in understanding how more reactive metals can replace less reactive ones in compounds, a principle that is widely applied in metallurgy, extraction of metals, and electrochemical cells."
      },
      {
        "equation": "\\text{Cu}^{2+}(aq) + \\text{Mg}(s) \\rightarrow \\text{Mg}^{2+}(aq) + \\text{Cu}(s)",
        "title": "Ionic Equation for Displacement (HT)",
        "description": "This ionic equation represents the displacement of copper ions by magnesium in an aqueous solution. Understanding ionic equations is crucial for analyzing redox reactions, where electrons are transferred between species. These reactions are fundamental in electrochemistry, metallurgy, and various chemical processes."
      },
      {
        "equation": "\\text{NaOH}(aq) + \\text{HCl}(aq) \\rightarrow \\text{NaCl}(aq) + \\text{H}_2\\text{O}(l)",
        "title": "Neutralisation",
        "description": "Sodium hydroxide reacts with hydrochloric acid to produce sodium chloride and water, an example of a neutralization reaction. This reaction is fundamental in acid-base chemistry and is used in various applications, including titrations, pH control, and the production of salts. Neutralization reactions are also important in everyday life, such as in antacid tablets neutralizing stomach acid."
      },
      {
        "equation": "\\text{H}^+(aq) + \\text{OH}^-(aq) \\rightarrow \\text{H}_2\\text{O}(l)",
        "title": "Ionic Equation for Neutralisation (HT)",
        "description": "This ionic equation represents the neutralization of hydrogen ions by hydroxide ions to form water. Understanding ionic equations is essential for analyzing the fundamental processes in acid-base reactions. This concept is widely used in chemical analysis, environmental science, and industrial processes involving acids and bases."
      },
      {
        "equation": "\\text{CaCO}_3(s) + 2\\text{HCl}(aq) \\rightarrow \\text{CaCl}_2(aq) + \\text{H}_2\\text{O}(l) + \\text{CO}_2(g)",
        "title": "Reaction of Marble Chips with Acid",
        "description": "Calcium carbonate (marble chips) reacts with hydrochloric acid to produce calcium chloride, water, and carbon dioxide. This reaction is a classic example of an acid-carbonate reaction, which is important in understanding the chemistry of carbonates and the production of carbon dioxide. It is also relevant in geology, where similar reactions occur naturally, and in industrial processes such as the production of cement and lime."
      },
      {
        "equation": "\\text{PbBr}_2(l) \\rightarrow \\text{Pb}(l) + \\text{Br}_2(g)",
        "title": "Electrolysis of Molten Ionic Compounds",
        "description": "Lead bromide undergoes electrolysis to produce molten lead and bromine gas. Electrolysis is a process that uses electrical energy to drive a non-spontaneous chemical reaction. It is widely used in industry for extracting and refining metals, electroplating, and producing chemicals like chlorine and hydrogen. Understanding the principles of electrolysis is crucial for applications in energy storage, metallurgy, and chemical manufacturing."
      },
      {
        "equation": "\\text{C}_{10}\\text{H}_{22} \\rightarrow \\text{C}_5\\text{H}_{10} + \\text{C}_5\\text{H}_{12}",
        "title": "Cracking",
        "description": "Cracking is a process where large hydrocarbon molecules, like decane, are broken down into smaller, more useful molecules such as pentene and pentane. This process is essential in the petrochemical industry for producing fuels and feedstock for chemical synthesis. Cracking is a critical step in refining crude oil and helps meet the demand for different types of hydrocarbons used in various industries."
      },
      {
        "equation": "\\text{NaCl}(aq) + \\text{H}_2\\text{O}(l) \\rightarrow \\text{NaOH}(aq) + \\text{H}_2(g) + \\text{Cl}_2(g)",
        "title": "Electrolysis of Aqueous Ionic Compounds (Sodium Chloride)",
        "description": "Electrolysis of an aqueous solution of sodium chloride produces sodium hydroxide, hydrogen gas, and chlorine gas. This process, known as the chlor-alkali process, is one of the most important industrial chemical processes, providing essential chemicals for various applications, including water purification, disinfectants, and the production of plastics like PVC."
      },
      {
        "equation": "2\\text{H}^+(aq) + 2e^- \\rightarrow \\text{H}_2(g)",
        "title": "Half Equation for Electrolysis (Cathode)",
        "description": "At the cathode during electrolysis, hydrogen ions gain electrons to form hydrogen gas. This half-reaction is crucial in understanding the reduction process in electrolysis, where positively charged ions (cations) gain electrons. This principle is applied in various industrial processes, including the production of hydrogen gas and the electroplating of metals."
      },
      {
        "equation": "2\\text{Cl}^-(aq) \\rightarrow \\text{Cl}_2(g) + 2e^-",
        "title": "Half Equation for Electrolysis (Anode)",
        "description": "At the anode during electrolysis, chloride ions lose electrons to form chlorine gas. This half-reaction is essential in understanding the oxidation process in electrolysis, where negatively charged ions (anions) lose electrons. Understanding this process is key in industries that produce chlorine gas, sodium hydroxide, and other important chemicals."
      },
      {
        "equation": "\\text{C}_2\\text{H}_4 + \\text{Br}_2 \\rightarrow \\text{C}_2\\text{H}_4\\text{Br}_2",
        "title": "Bromine Test for Alkenes",
        "description": "Ethene reacts with bromine to form dibromoethane in a test that identifies alkenes. This reaction is a classic example of an addition reaction, where bromine adds across the double bond in the alkene. The bromine test is widely used in organic chemistry to distinguish alkenes from alkanes, as alkenes decolorize bromine water, indicating the presence of a carbon-carbon double bond."
      },
      {
        "equation": "\\text{N}_2(g) + 3\\text{H}_2(g) \\rightarrow 2\\text{NH}_3(g)",
        "title": "The Haber Process",
        "description": "The Haber process synthesizes ammonia from nitrogen and hydrogen, a reaction that is critical for producing fertilizers and other chemicals. The process operates under high pressure and temperature, using an iron catalyst. Understanding the Haber process is vital in industrial chemistry, where it plays a key role in sustaining global agriculture by producing ammonia for fertilizers, which are essential for food production."
      }
    ]
  },
  "biology": {
    "foundation": [
      {
        "equation": "6\\text{CO}_2 + 6\\text{H}_2\\text{O} \\rightarrow \\text{C}_6\\text{H}_{12}\\text{O}_6 + 6\\text{O}_2",
        "title": "Photosynthesis (Symbol Equation)",
        "description": "Photosynthesis is the process by which green plants and some other organisms use sunlight to synthesize foods with the primary product being glucose (C₆H₁₂O₆). The balanced symbol equation shows that six molecules of carbon dioxide (CO₂) and six molecules of water (H₂O) are converted into one molecule of glucose (C₆H₁₂O₆) and six molecules of oxygen (O₂), using light energy captured by chlorophyll in the chloroplasts. This process is vital for life on Earth as it is the foundation of the food chain and a significant source of oxygen."
      },
      {
        "equation": "carbon dioxide + water \\rightarrow glucose + oxygen",
        "title": "Photosynthesis (Word Equation)",
        "description": "The word equation for photosynthesis expresses the same process as the symbol equation, stating that carbon dioxide and water are converted into glucose and oxygen. This process occurs in the chloroplasts of plant cells and is crucial for converting light energy into chemical energy, which is stored in the bonds of glucose. This glucose can then be used by the plant for energy and growth, or it can be stored as starch."
      },
      {
        "equation": "glucose \\rightarrow ethanol + carbon dioxide + energy",
        "title": "Anaerobic Respiration in Plants",
        "description": "In anaerobic respiration, plants and some microorganisms convert glucose into ethanol, carbon dioxide, and energy in the absence of oxygen. This process occurs in the cytoplasm and is used by yeast during fermentation. Anaerobic respiration is less efficient than aerobic respiration because it produces less energy per glucose molecule. However, it is crucial in environments where oxygen is limited, such as waterlogged soils."
      },
      {
        "equation": "glucose \\rightarrow lactic acid + energy",
        "title": "Anaerobic Respiration in Animals",
        "description": "Anaerobic respiration in animals occurs when muscle cells respire in the absence of oxygen, such as during intense exercise. In this process, glucose is converted into lactic acid and energy. The accumulation of lactic acid in muscles can lead to fatigue and cramps. Anaerobic respiration is less efficient than aerobic respiration because it produces less energy and does not completely break down glucose."
      },
      {
        "equation": "\\text{C}_6\\text{H}_{12}\\text{O}_6 + 6\\text{O}_2 \\rightarrow 6\\text{CO}_2 + 6\\text{H}_2\\text{O}",
        "title": "Aerobic Respiration (Symbol Equation)",
        "description": "Aerobic respiration is the process by which cells convert glucose and oxygen into carbon dioxide, water, and energy (in the form of ATP). The symbol equation shows that one molecule of glucose (C₆H₁₂O₆) reacts with six molecules of oxygen (O₂) to produce six molecules each of carbon dioxide (CO₂) and water (H₂O). This reaction takes place in the mitochondria of cells and is the primary way in which cells obtain energy."
      },
      {
        "equation": "glucose + oxygen \\rightarrow carbon dioxide + water + energy",
        "title": "Aerobic Respiration (Word Equation)",
        "description": "The word equation for aerobic respiration describes the process by which glucose and oxygen are converted into carbon dioxide, water, and energy. This process is essential for the survival of aerobic organisms, providing the energy required for various cellular processes. The energy produced is stored in molecules of ATP, which cells use to power their activities."
      },
      {
        "equation": "\\text{Total magnification} = \\text{eyepiece} \\times \\text{objective lens}",
        "title": "Total Magnification",
        "description": "Total magnification in microscopy is calculated by multiplying the magnification of the eyepiece lens by the magnification of the objective lens. This equation is used to determine how much larger an object appears under the microscope compared to its actual size. Understanding magnification is crucial in fields such as biology and material science, where microscopic structures need to be examined in detail."
      },
      {
        "equation": "\\text{Rate of reaction} = \\frac{\\text{change in mass}}{\\text{time taken}}",
        "title": "Rate of Reaction",
        "description": "The rate of reaction measures how quickly a reactant is consumed or a product is formed in a chemical reaction. It is calculated by dividing the change in mass of a substance by the time taken for the reaction to occur. This concept is essential in biology, particularly in enzyme kinetics, where the rate at which enzymes catalyze reactions is studied."
      },
      {
        "equation": "\\text{Magnification} = \\frac{\\text{Image size}}{\\text{real size}}",
        "title": "Magnification",
        "description": "Magnification is the ratio of the size of the image produced by a microscope to the actual size of the object being observed. This equation is fundamental in microscopy, allowing scientists to understand the scale of what they are observing. It is essential in fields like cell biology, histology, and materials science, where precise measurements of small structures are necessary."
      }
    ]
  },
  "maths": {
    "foundation": [
      {
        "equation": "ax^2 + bx + c = 0",
        "title": "Quadratic Equation",
        "description": "The quadratic equation is a polynomial equation of degree 2, where 'a', 'b', and 'c' are constants and x represents an unknown variable. It takes the form ( ax^2 + bx + c = 0 ). The solutions to the quadratic equation can be found using the quadratic formula. Quadratic equations are fundamental in algebra and appear in various contexts, such as solving problems involving area, projectile motion, and optimization."
      },
      {
        "equation": "x = \\frac{-b \\pm \\sqrt{b^2 - 4ac}}{2a}",
        "title": "Quadratic Formula",
        "description": "The quadratic formula provides the solutions to a quadratic equation ( ax^2 + bx + c = 0 ). It is derived by completing the square on the general quadratic equation. The discriminant, ( b^2 - 4ac ), inside the square root determines the nature of the roots: if positive, there are two real and distinct solutions; if zero, there is one real solution (a repeated root); if negative, there are two complex solutions. The quadratic formula is widely used in mathematics for solving equations where factoring is difficult or impossible."
      },
      {
        "equation": "y \\propto x \\rightarrow y = kx",
        "title": "Direct Proportionality",
        "description": "Direct proportionality indicates that two variables, y and x, are related in such a way that if one increases, the other also increases at a constant rate. This relationship is expressed as ( y \\propto x ), meaning y is directly proportional to x. It can be written as ( y = kx ), where k is the constant of proportionality. This concept is essential in various fields, including physics, economics, and biology, where it describes linear relationships between quantities."
      },
      {
        "equation": "y \\propto x^2 \\rightarrow y = kx^2",
        "title": "Direct Proportionality (Squared)",
        "description": "When y is directly proportional to the square of x, the relationship is expressed as ( y \\propto x^2 ), which translates to ( y = kx^2 ). This means that y increases as the square of x increases. Such relationships appear in physics, particularly in laws involving areas, forces, and energy, where the effect of one variable is squared."
      },
      {
        "equation": "y \\propto \\frac{1}{x} \\rightarrow y = \\frac{k}{x}",
        "title": "Inverse Proportionality",
        "description": "Inverse proportionality describes a relationship where one variable increases while the other decreases. If y is inversely proportional to x, this is expressed as ( y \\propto \\frac{1}{x} ) or ( y = \\frac{k}{x} ), where k is a constant. This concept is used in physics to describe relationships such as the inverse square law, where force or intensity decreases with the square of the distance from a source."
      },
      {
        "equation": "y \\propto \\frac{1}{x^2} \\rightarrow y = \\frac{k}{x^2}",
        "title": "Inverse Proportionality (Squared)",
        "description": "In this relationship, y is inversely proportional to the square of x, meaning as x increases, y decreases at a rate proportional to the square of x. It is expressed as ( y \\propto \\frac{1}{x^2} ) or ( y = \\frac{k}{x^2} ). This concept is important in physics, particularly in understanding gravitational and electrostatic forces, where the force between two objects decreases with the square of the distance between them."
      },
      {
        "equation": "Speed = \\frac{\\text{distance}}{\\text{time}}",
        "title": "Speed",
        "description": "Speed is a measure of how fast an object is moving. It is calculated by dividing the distance traveled by the time taken. Speed is a scalar quantity, meaning it only has magnitude and no direction. This formula is used in everyday life to calculate how fast a vehicle is moving or how quickly a person can walk a certain distance. In physics, it forms the basis for understanding motion and kinematics."
      },
      {
        "equation": "Density = \\frac{\\text{mass}}{\\text{volume}}",
        "title": "Density",
        "description": "Density is a measure of how much mass is contained within a given volume. It is calculated by dividing the mass of an object by its volume. Density is an important property in physics and engineering, as it affects how materials behave under different conditions, such as floating or sinking in a fluid. This formula is also crucial in determining material properties and is widely used in geology, material science, and fluid dynamics."
      },
      {
        "equation": "Pressure = \\frac{\\text{force}}{\\text{area}}",
        "title": "Pressure",
        "description": "Pressure is the amount of force applied per unit area. It is calculated using the formula ( Pressure = \\frac{\\text{force}}{\\text{area}} ). Pressure is a critical concept in physics, particularly in fluid mechanics and thermodynamics, where it helps explain phenomena such as buoyancy, atmospheric pressure, and the behavior of gases. Understanding pressure is also essential in engineering, where it influences the design of structures, vessels, and machinery."
      },
      {
        "equation": "Area = l \\times w",
        "title": "Area of a Rectangle",
        "description": "The area of a rectangle is calculated by multiplying its length (l) by its width (w). This formula is a basic concept in geometry and is used to determine the size of rectangular surfaces in various applications, from calculating the floor space in a room to determining the amount of material needed to cover a surface."
      },
      {
        "equation": "Area = \\frac{1}{2} b \\times h",
        "title": "Area of a Triangle",
        "description": "The area of a triangle is calculated using the formula ( Area = \\frac{1}{2} b \\times h ), where b is the base, and h is the height of the triangle. This formula is fundamental in geometry and is used to find the area of triangular shapes in various fields, including construction, art, and science. It also forms the basis for more complex calculations involving trigonometry and calculus."
      },
      {
        "equation": "Area = b \\times h",
        "title": "Area of a Parallelogram",
        "description": "The area of a parallelogram is calculated by multiplying the base (b) by the vertical height (h). This formula is similar to that of a rectangle but is specifically used for parallelograms, where opposite sides are parallel but not necessarily equal. The area of a parallelogram is important in various applications, including architecture, engineering, and mathematics."
      },
      {
        "equation": "Area = \\frac{1}{2} (a + b) \\times h",
        "title": "Area of a Trapezium",
        "description": "The area of a trapezium (or trapezoid) is calculated using the formula ( Area = \\frac{1}{2} (a + b) \\times h ), where a and b are the lengths of the parallel sides, and h is the height. This formula is used to find the area of trapezoidal shapes, which are common in various engineering and architectural designs, as well as in nature and art."
      },
      {
        "equation": "Sum of interior angles = (\\text{number of sides} - 2) \\times 180",
        "title": "Sum of Interior Angles for a Regular Polygon",
        "description": "The sum of the interior angles of a regular polygon (a polygon with all sides and angles equal) is calculated using the formula ( (\\text{number of sides} - 2) \\times 180 ). This formula is derived from the fact that a polygon can be divided into triangles, each contributing 180° to the total angle sum. This concept is fundamental in geometry and is used to analyze and design various shapes in art, architecture, and engineering."
      },
      {
        "equation": "Interior angle of a regular polygon = \\frac{(\\text{number of sides} - 2) \\times 180}{\\text{number of sides}}",
        "title": "Interior Angle of a Regular Polygon",
        "description": "The interior angle of a regular polygon is calculated by dividing the sum of its interior angles by the number of sides. This formula helps in understanding the geometry of regular polygons, where all angles are equal, and is important in various design and architectural applications."
      },
      {
        "equation": "Exterior angle of a regular polygon = \\frac{360}{\\text{number of sides}}",
        "title": "Exterior Angle of a Regular Polygon",
        "description": "The exterior angle of a regular polygon is calculated by dividing 360° by the number of sides. This formula is important in understanding the properties of polygons and is used in various fields, including geometry, architecture, and engineering."
      },
      {
        "equation": "Circumference = c = 2\\pi r = \\pi d",
        "title": "Circumference of a Circle",
        "description": "The circumference of a circle is the distance around the circle and is calculated using the formula ( c = 2\\pi r = \\pi d ), where r is the radius, and d is the diameter. This formula is fundamental in geometry and is used in various applications, from measuring circular objects to calculating distances in circular motion."
      },
      {
        "equation": "Area = A = \\pi r^2",
        "title": "Area of a Circle",
        "description": "The area of a circle is calculated using the formula ( A = \\pi r^2 ), where r is the radius. This formula is essential in geometry and is used to determine the size of circular surfaces in various applications, including design, engineering, and physics."
      },
      {
        "equation": "Volume = l \\times w \\times h",
        "title": "Volume of a Cuboid",
        "description": "The volume of a cuboid (a rectangular box) is calculated by multiplying its length (l), width (w), and height (h). This formula is fundamental in geometry and is used to calculate the volume of rectangular objects in various fields, including construction, manufacturing, and shipping."
      },
      {
        "equation": "Volume = \\text{area of cross section} \\times \\text{length}",
        "title": "Volume of a Prism",
        "description": "The volume of a prism is calculated by multiplying the area of its cross section by its length. This formula is used in geometry to determine the volume of prismatic objects, which have a uniform cross-sectional area along their length. It is applicable in various engineering and architectural designs."
      },
      {
        "equation": "Volume = \\pi r^2 h",
        "title": "Volume of a Cylinder",
        "description": "The volume of a cylinder is calculated using the formula ( V = \\pi r^2 h ), where r is the radius of the base, and h is the height. This formula is fundamental in geometry and is used to calculate the volume of cylindrical objects, such as pipes, tanks, and cans."
      },
      {
        "equation": "Volume = \\frac{1}{3} \\times \\text{area of base} \\times \\text{vertical height}",
        "title": "Volume of a Pyramid",
        "description": "The volume of a pyramid is calculated by multiplying the area of its base by its vertical height and then dividing by 3. This formula is important in geometry and is used to calculate the volume of pyramidal structures, which are common in architecture and design."
      },
      {
        "equation": "Volume = \\frac{4}{3} \\pi r^3",
        "title": "Volume of a Sphere",
        "description": "The volume of a sphere is calculated using the formula ( V = \\frac{4}{3} \\pi r^3 ), where r is the radius. This formula is fundamental in geometry and is used to calculate the volume of spherical objects, such as balls, planets, and bubbles. It is also important in physics, particularly in understanding the properties of spherical shapes in three-dimensional space."
      },
      {
        "equation": "Surface area = 4\\pi r^2",
        "title": "Surface Area of a Sphere",
        "description": "The surface area of a sphere is calculated using the formula ( A = 4\\pi r^2 ), where r is the radius. This formula is essential in geometry and is used to calculate the surface area of spherical objects, which is important in various applications, including physics, engineering, and design."
      },
      {
        "equation": "Volume = \\frac{1}{3} \\pi r^2 h",
        "title": "Volume of a Cone",
        "description": "The volume of a cone is calculated using the formula ( V = \\frac{1}{3} \\pi r^2 h ), where r is the radius of the base, and h is the height. This formula is fundamental in geometry and is used to calculate the volume of conical objects, such as ice cream cones, funnels, and conical flasks."
      },
      {
        "equation": "Curved surface area = \\pi r l",
        "title": "Curved Surface Area of a Cone",
        "description": "The curved surface area of a cone is calculated using the formula ( A = \\pi r l ), where r is the radius of the base and l is the slant height. This formula is important in geometry and is used to calculate the area of the curved surface of conical objects, which is relevant in various design and engineering applications."
      }
    ],
    "higher": [
      {
        "equation": "a^2 + b^2 = c^2",
        "title": "Pythagoras' Theorem",
        "description": "Pythagoras' theorem is a fundamental principle in geometry that states that in a right-angled triangle, the square of the length of the hypotenuse (c) is equal to the sum of the squares of the lengths of the other two sides (a and b). This theorem is widely used in mathematics to calculate distances, determine the properties of triangles, and solve problems involving right-angled triangles."
      },
      {
        "equation": "\\sin(x) = \\frac{\\text{opp}}{\\text{hyp}}",
        "title": "Sine Function",
        "description": "The sine function in trigonometry relates the angle x in a right-angled triangle to the ratio of the length of the opposite side to the hypotenuse. The sine function is essential in solving problems involving right-angled triangles and is widely used in various applications, including physics, engineering, and computer graphics."
      },
      {
        "equation": "\\cos(x) = \\frac{\\text{adj}}{\\text{hyp}}",
        "title": "Cosine Function",
        "description": "The cosine function in trigonometry relates the angle x in a right-angled triangle to the ratio of the length of the adjacent side to the hypotenuse. The cosine function is widely used in mathematics and engineering to solve problems involving right-angled triangles and to model oscillatory motion, such as waves."
      },
      {
        "equation": "\\tan(x) = \\frac{\\text{opp}}{\\text{adj}}",
        "title": "Tangent Function",
        "description": "The tangent function in trigonometry relates the angle x in a right-angled triangle to the ratio of the length of the opposite side to the adjacent side. The tangent function is important in solving problems involving right-angled triangles and is used in various applications, including surveying, navigation, and physics."
      },
      {
        "equation": "\\frac{a}{\\sin(A)} = \\frac{b}{\\sin(B)} = \\frac{c}{\\sin(C)}",
        "title": "Sine Rule",
        "description": "The sine rule relates the lengths of the sides of a triangle to the sines of its angles. It is used in non-right-angled triangles to find missing sides or angles and is essential in trigonometry for solving various geometric problems, including those involving navigation, astronomy, and engineering."
      },
      {
        "equation": "a^2 = b^2 + c^2 - 2bc\\cos(A)",
        "title": "Cosine Rule",
        "description": "The cosine rule is used in trigonometry to relate the lengths of the sides of a triangle to the cosine of one of its angles. It is particularly useful for solving problems involving non-right-angled triangles, such as finding the length of a side or the measure of an angle when other sides and angles are known. The cosine rule is widely used in engineering, physics, and geometry."
      },
      {
        "equation": "\\cos(A) = \\frac{b^2 + c^2 - a^2}{2bc}",
        "title": "Cosine Rule (Alternative Form)",
        "description": "This alternative form of the cosine rule expresses the cosine of an angle in terms of the lengths of the sides of a triangle. It is useful for finding the measure of an angle when all three sides of a triangle are known. The cosine rule is fundamental in trigonometry and is applied in various fields, including architecture, astronomy, and navigation."
      },
      {
        "equation": "Area = \\frac{1}{2} ab\\sin(C)",
        "title": "Area of a Triangle (Using Sine)",
        "description": "The area of a triangle can be calculated using the formula ( Area = \\frac{1}{2} ab\\sin(C) ), where a and b are the lengths of two sides, and C is the angle between them. This formula is particularly useful for finding the area of triangles when the base and height are not known directly. It is widely used in trigonometry, geometry, and engineering."
      },
      {
        "equation": "New value = \\text{original} \\times \\left(1 + \\frac{\\text{percentage}}{100}\\right)^{\\text{time}}",
        "title": "Compound Interest",
        "description": "Compound interest is the interest calculated on the initial principal and also on the accumulated interest from previous periods. The formula calculates the new value after a certain time, taking into account the percentage interest rate. Compound interest is fundamental in finance, economics, and investment, as it describes how investments grow over time."
      },
      {
        "equation": "New value = \\text{original} \\times \\left(1 - \\frac{\\text{percentage}}{100}\\right)^{\\text{time}}",
        "title": "Depreciation",
        "description": "Depreciation refers to the reduction in the value of an asset over time, often due to wear and tear or obsolescence. The formula calculates the depreciated value of an asset after a certain period. Depreciation is a key concept in accounting and finance, where it is used to allocate the cost of tangible assets over their useful lives."
      },
      {
        "equation": "\\frac{\\text{percentage}}{100} \\times \\text{amount}",
        "title": "Percentage of Amount",
        "description": "This formula calculates the percentage of a given amount. It is used in various everyday situations, such as calculating discounts, interest rates, and proportions. Understanding percentages is fundamental in mathematics, finance, and statistics."
      },
      {
        "equation": "\\text{Percentage Change} = \\frac{\\text{new} - \\text{original}}{\\text{original}} \\times 100",
        "title": "Percentage Change",
        "description": "Percentage change measures the relative change between an old value and a new value, expressed as a percentage. It is widely used in finance, economics, and various fields of science to compare changes over time or between different scenarios."
      },
      {
        "equation": "Frequency Density = \\frac{\\text{frequency}}{\\text{class width}}",
        "title": "Frequency Density (Histograms)",
        "description": "Frequency density is used in histograms to represent the frequency of data within each class interval. It is calculated by dividing the frequency by the class width. This concept is important in statistics for visualizing the distribution of data and is widely used in data analysis and interpretation."
      },
      {
        "equation": "P(A \\text{ or } B) = P(A) + P(B) - P(A \\text{ and } B)",
        "title": "Probability (Addition Rule)",
        "description": "The addition rule of probability is used to calculate the probability of either event A or event B occurring. It accounts for the possibility that both events may occur simultaneously, which would otherwise be counted twice. This rule is fundamental in probability theory and is used in various fields, including statistics, gambling, and risk assessment."
      },
      {
        "equation": "P(A \\text{ and } B) = P(A \\text{ given } B)P(B)",
        "title": "Probability (Multiplication Rule)",
        "description": "The multiplication rule of probability calculates the probability of both events A and B occurring. It is particularly useful when events are dependent, meaning the occurrence of one event affects the probability of the other. This rule is crucial in understanding conditional probability and is applied in fields such as statistics, game theory, and decision-making."
      },
      {
        "equation": "v = u + at",
        "title": "Kinematic Equation (Velocity)",
        "description": "This kinematic equation relates the final velocity (v) of an object to its initial velocity (u), acceleration (a), and time (t). It is used to describe the motion of objects under constant acceleration, such as freely falling bodies. This equation is fundamental in physics, particularly in mechanics, where it is used to analyze and predict the motion of objects."
      },
      {
        "equation": "s = ut + \\frac{1}{2} at^2",
        "title": "Kinematic Equation (Displacement)",
        "description": "This kinematic equation calculates the displacement (s) of an object under constant acceleration, given its initial velocity (u), acceleration (a), and time (t). It is essential in understanding the motion of objects, particularly in scenarios where acceleration is involved, such as in vehicle motion, projectile trajectories, and free fall."
      },
      {
        "equation": "v^2 = u^2 + 2as",
        "title": "Kinematic Equation (Velocity and Displacement)",
        "description": "This kinematic equation relates the final velocity (v) of an object to its initial velocity (u), acceleration (a), and displacement (s). It is used to analyze the motion of objects under constant acceleration, providing a way to calculate the velocity or displacement when time is not directly involved. This equation is widely used in physics and engineering to solve problems involving motion."
      }
    ]
  }
}
